NYSERDA/20200515/precursor.internal.wrf/0.original/qwall
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      qwall;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"

dimensions      [ 0 1 -1 1 0 0 0 ];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    lower
    {
//      type            specifiedSurfaceTemperature;
//      TSurface        table
//      (
//          #include "../constant/drivingData/surfaceSkinPotentialTemperatureTable"
//      );
//      kappa           $kappa;
//      z0              uniform $z0;
//      betaM           $betaM;
//      gammaM          $gammaM;
//      betaH           $betaH;
//      gammaH          $gammaH;
//      alphaH          $alphaH;
//      averageType     "planarAverage";

        type            uniformFixedValue;
        uniformValue    table
        (
            // from 2019-12-25 15Z
            #include "../constant/drivingData/qwallTable"
        );
        
        value           uniform $qwall;
    }
    upper
    {
        type            fixedValue;
        value           $internalField;
    }
    west 
    {
        type            cyclic;
        value           $internalField;
    }
    east 
    {
        type            cyclic;
        value           $internalField;
    }
    north 
    {
        type            cyclic;
        value           $internalField;
    }
    south
    {
        type            cyclic;
        value           $internalField;
    }
}


// ************************************************************************* //
