NYSERDA/20200515/precursor.internal.wrf/system/sampling/arrayStructured.1
    arrayStructured.1
    {
          type                sets;
          libs             ( "libsampling.so" "libSOWFAsampling.so" );
          enabled             true;
          interpolationScheme cellPoint;
          writeControl        timeStep;
          writeInterval       1;
          setFormat           ensight;
          fields
          (
              U
              T
          );
 
          sets
          (
              array.1
              {
                  type                 arrayStructured;
                  axis                 xyz;
                  origin             ( 2599.5936714352106 2442.500566987298 0.001 );
                  pointsDensity      ( 1 24 24 );
                  spanBox            ( 0.001 230.0 230.0 );
                  coordinateRotation
                  {
                        type           axesRotation;
                        e1           ( 0.5000000000000001 0.8660254037844386 0.0 );
                        e2           ( -0.8660254037844386 0.5000000000000001 0.0 );
                  }
              }
          );
    }