NYSERDA/20200515/precursor.internal.wrf/system/sampling/planarAverages
      planarAverages
      {
          type                 planarAveraging;
          functionObjectLibs   ("libSOWFAfieldFunctionObjects.so");
          enabled              true;
          writeControl        timeStep;
          writeInterval        1;
          fields
          (
              U
              T
              UU
              wUU
              TU
          );
      }
